[{"text":"Had a good time yesterday on our adult outing. Went to the Cherry Blossom Festival. Thank you all for going. And Miss Carol putting that together. Had a good time Friday night with our movie night in our new building out there.","start":1810,"end":16554},{"text":"We backed froze to death, but we had a good time out there. Some of them froze death. I didn't really, but you know how it goes, but it was fun. Had a good fun. Cute movie.","start":16592,"end":27538},{"text":"So we're going to do that again. Looking to see I don't really see a lot going on. We got Easter coming up and Easter egg Hunt will be the next month, which is only a week or so away. Can you believe that? We're already into April, so just keep that in mind as we go forward with that.","start":27574,"end":51654},{"text":"And our buildings come along. Our heating and air is done. Electricians are getting close to be done. And maybe that sorry plumber can get done sooner or later. And I know him personally, so he don't mind me talking about him that way.","start":51692,"end":65780},{"text":"We're getting along. The framing still needs a little more work. Probably have to have another work day, but it's coming along if you want to go out and see it. I don't know if it's unlocked now or not, but we'll be glad to unlock it. And you can stroll around.","start":70230,"end":82930},{"text":"Just be careful. It is a construction site, so if you'd like to go out and look and see the progress, that'd be great. Just keep in prayer about that. We sort of trying to do some figures of where we're at and what we need and the prices of things way up, and there's still a need there. So just continue to pray about that and God blessing us and we're going forward with it.","start":82980,"end":107698},{"text":"Excited about it. So just keep up in your prayers. Anything else? Announcements wise, Mr. David is covering for Mr.","start":107724,"end":118466},{"text":"David this morning. David Burgess is out of town on business, having to do some work. Some of them got to work every now and then. So thank you for covering for that. Anything else announcements that I'm missing this morning.","start":118528,"end":138440},{"text":"All right. I hope we got some lively songs because I think they need to be woke up. But anyway, good to see you this morning. Let's go to the Lord in prayer. Father, we thank you again that we can come to your presence to worship and song as we study your word.","start":139550,"end":154350},{"text":"Lord, just pray for that you would lead and guide us by the power of your Holy Spirit that we'd say and do the things that you would have us say and do and that you would be blessed in the songs that we sing approved to you be with us in these next few minutes as we come together of fellowship and to worship. Father, we pray for the ones that can't be with us for whatever reason. I know some are traveling that you'd be with them. Many are sick that you send healing Father. We just pray for those that are in need.","start":154400,"end":188970},{"text":"You know their needs Father, and just help us as a Church to reach out to them and to know what we can do for them to Minister their needs. We just pray for our country this morning that you would be with us and that and it just seems like there's total chaos all around us and that things are just going downhill quickly, Lord. But we understand that you have all things in your control or just help us to be a beacon of light in a dark world, that our light would shine in our communities first of all and in our country, Lord, that you would just lead and guide and have your perfect will and your way in that we just praise you today Father, for the privilege to come before you and to worship you in Jesus name I pray. Amen. David, leave us in worship.","start":189020,"end":239310},{"text":"Good morning. I hope everybody had a good week left. Stand stretch turn around wave to somebody you hadn't spoke to this morning and turn page 572 please.","start":243030,"end":254580},{"text":"This is my story this is my song Praising my Singapore holding it all this is my story this is my song Praising my savior all the day long Burning submission perfectly light visions of Rapture now burst on my sight Ain't no descending bring from a block this is my story this is my song Praising my savior all the day on perfect submission always at risk I'm happy and blessed Watching and waiting looking above Filled with his goodness lost in his words this is my story this is my song Raising my savior all the days God's Grace Grace that will pardon and quit with it bitter than oversight more but such less Grace free me stole on Father believe you that are longing to see his face God's Grace Grace that will pardon and twins within Grace Grace God's Grace Grace It is greater than hope our sin 493 please down at the cross where my favorite your die down where from when Saint from sein I cried there to my heart was a flood of light glory to his 505 please she's now I am no longer the same he touched me oh he touched me something happened and now I know he touched me and made me whole good morning.","start":293090,"end":933440},{"text":"That's a good looking crowd this morning. Good to have him here.","start":937430,"end":942440},{"text":"I liked that good old song. He touched me and made me hope something happened and now I know he touched me It goes along with our message this morning that I want to talk to you about. There are many who nowadays will teach that we cannot really know of our Salvation until we get to heaven. That's reassuring, isn't it? There are a lot of I guess you call it theologians, I guess they say, oh, it's just you hope and you hope it is.","start":944450,"end":988314},{"text":"And we've talked about this before. I don't really like to hear Christians say, I hope I get there. I hope that I'm saved yesterday. I sort of said that. And we were at the Cherry Blossom Festival and there was a booth there, and they were sharing the gospel and giving out tracks.","start":988352,"end":1008150},{"text":"And the guy just walked up to me and shook my hand. He said, do you know Jesus? And I said, Well, I better hope so. And he said, oh, no, you can't hope so. You got to know so.","start":1008470,"end":1018278},{"text":"And I said, oh, I know so. I said, I'm a pastor of a Church. I better know who he is. It was just sort of a funny thing, but he even got on, no, we can know. We can know, but there are many who teach now.","start":1018304,"end":1030698},{"text":"You can't really know until you get to heaven. And that is the furthest thing from the truth. The Bible is very clear about us knowing. So I want to talk about the assurance of your Salvation this morning. If you'll turn in your Bibles to one John, we are going to be looking in verses throughout the book of one John.","start":1030724,"end":1052754},{"text":"There's only five chapters. I'm not going to read all five chapters, but there are things in one John that will tell us the assurance of our Salvation. There are evidences of our Salvation that he brings out and makes clear. And I think it's a very important thing today because just to be honest with you, there's a lot of false teachings out there, a lot of things going around. And to be honest with you, it'll just make you look and say, wow, do I really believe the right thing?","start":1052792,"end":1085120},{"text":"And don't be surprised with this. The Bible teaches us that this is the way it's going to be in the end times, that there will be many antichrists that will come and they will teach false doctrines. I have been warning you in the last few weeks, be careful of those be careful of false teachings, of those who would take and twist the gospel and say, well, they're using the Bible. Satan did, too. Remember the very first temptation?","start":1085570,"end":1114294},{"text":"Satan tempted Eve. He took the very word of God and twisted it into a lie to deceive Adam and Eve. So Satan knows scripture probably better than we do, and he'll take that scripture and twist it around into a father. And that's exactly what's going on today. Be very careful.","start":1114402,"end":1134262},{"text":"I want to go over some things with you this morning. This is John, the disciple that Jesus loved. We'll talk about that in a few minutes of how he came to that name. But in the gospel, this is the same John that wrote the Gospel of John, Matthew, Mark, Luke, John. Well, first John is the same John.","start":1134406,"end":1157840},{"text":"He's up in years now when he writes first John, later in years, and he wrote the first gospel to tell people how to be saved. He says in John not First John in John 2030 through 31. And many other signs truly did Jesus in the presence of his disciples, which are not written in this book. He says, but these things, these things I've written to you in the book, in the Gospel of John, that you might believe that Jesus is the Christ, the Son of God, and that believing you might have life through his name. So the gospel of John was to show you how to be saved, that you believe on the name of the Son of God, that you believe that he is the Son of God and that he has given you eternal life.","start":1158470,"end":1210650},{"text":"Now he comes to First John and he writes this letter to tell the people how they can be sure that they are saved. The whole book of one John is talking about the Assurity of Salvation. Some preachers will even say, well, there's a test in here. You can answer these few questions and these few things that he brings up just to measure and to look at your Salvation and your experience and where you're at. Do you fit into what God calls a believer?","start":1210820,"end":1244962},{"text":"Do you fit in what is called a bornagain Christian? He says in one John, five, one, three. These things have I written unto you talking about one John, that I've written unto you that believe on the name of the Son of God, that you may know that you have eternal life and that you may believe on the name of the Son of God. 31 times in these five chapters, John says that you know that you know that is the emphasis of the first John to know in whom you have believed, to know the assurance of your Salvation. Don't be deceived by these others that will add the law.","start":1245106,"end":1293942},{"text":"The others will say, you got to be baptized. It's only by the blood of Jesus Christ, period. Don't add anything to it. Don't take anything away from it. It is through the blood of Jesus Christ, we are saved.","start":1294016,"end":1307698},{"text":"Now, do you want to know how do you want to know how you can look at this and say, Am I a believer? I think if anyone, to be honest, there are times in your life that you look back and say, I hope I'm saved. I hope I'm not good. Am I the only one in here that's ever just said, wow, I know what the Bible says and I want to know for sure. Even they say, DL Moody, great preacher, came to the point in his life where he said, I've got to know, Lord.","start":1307734,"end":1344754},{"text":"He spent three days in a motel room fasting and praying, God, reveal yourself to me. I want to know that I know that. I know that. I know on that third day, he walked out of change man with the Holy Spirit revealed to him that he was the truth, that he was a believer. He was doing exactly what even John the Baptist.","start":1344922,"end":1368598},{"text":"You remember when he was in prison, John the Baptist spent his whole Ministry preaching repent for the Kingdom of heaven as at hand. He baptized Jesus himself. He said, Here comes the Lamb of God, which taketh away the sins of the world of whom I'm not worthy to even latch his shoes, that's tie his shoes. Nowadays in our country, he said, I'm not even worthy to tie his shoes. This is John the Baptist.","start":1368634,"end":1396138},{"text":"But when he was in prison, he sent a messenger to Jesus saying, Art thou he? Or should we look for another? We all come to a point if we're honest with ourselves, that we want to just make sure Peter says, make sure that you're calling an election is sure. I don't think it's a bad thing for us to examine ourselves and say, Where am I at? Is my experience just an experience of walking an aisle?","start":1396174,"end":1424686},{"text":"Was I just baptized one day? What is my experience? Is it a real thing to me? And John writes this whole book to tell you, is it real? Do you know, or do you need to examine yourself?","start":1424878,"end":1440990},{"text":"Do you need to check into where you and I'm not trying to get you to doubt your Salvation, but I think these are good steps to us to look at and to examine. There are some difficult I'll be honest with you, I used to always just sort of sway away that word from the first John because it was difficult. It was hard for me to understand and hard to get a good grasp of what he was saying. But as I studied it and studied and read over and over and over, I began to understand this was an exciting news. This was a message of good news, of the assurance of our Salvation.","start":1441100,"end":1482870},{"text":"So let's just dive in. Here we'll go to first John. We started one. John 513. These things that I've written unto you, that you may know that you have eternal life and that you may believe on the name of the Son of God.","start":1484210,"end":1499000},{"text":"Father, as we study your word, I ask that you would give me every word to say. Lord, I pray through the power of your Holy Spirit that you would speak through me the truth of the word. Lord, I pray that the Holy Spirit would open our eyes and our ears to examine your word. To examine ourselves, Lord, just reveal truth to us. This morning as I stand and proclaim the good news of Jesus Christ.","start":1499450,"end":1525602},{"text":"Lord, I pray you'd hide me behind the cross, that you'd give me every word to say. In Jesus name, I pray, Amen. To me. This is a very important passage of scripture. I don't take it lightly because I'm telling you whether you have accepted Jesus, your friend, you believe that he died on the cross for his sin.","start":1525796,"end":1546738},{"text":"You have confessed with your mouth. The Lord Jesus, believing in the heart that God has raised him from the dead. The Bible says, Thou shalt be saved. Now don't get confused. Don't think I'm adding anything to it.","start":1546834,"end":1557786},{"text":"What John is telling us here are evidences of your Salvation, not requirements. There's a difference. Okay, first get that clear. He said if you are a born again believer, a true born again believer, you will do this. I've used illustration many times.","start":1557908,"end":1577238},{"text":"If I'm married to Robin, I have a piece of paper that says so, right? Really? We can't even find that piece of paper right now. I don't know where it's at. We got a marriage license somewhere.","start":1577384,"end":1589194},{"text":"So how do I know? Well, I know I experienced it one time. I remember the wedding. I remember all that. But how do I know that her and I have a relationship?","start":1589302,"end":1600100},{"text":"It's a daily thing. It's a thing that I want to spend time with her. I think she wants to spend time with me. I hope so. Anyway, it's a relationship that we share, a bond that we share in marriage.","start":1600850,"end":1615890},{"text":"It's the result of our wedding day, not our wedding day. Does that make sense? So these tests are a result of your Salvation experience, not a requirement. Okay, the first test that I guess we would have that we could look at and I didn't do this in any particular order. And to be honest with you, the book of John, he starts out and he makes a statement and then he'll go on to the second chapter and he'll make that statement again.","start":1617050,"end":1648722},{"text":"He goes on to the fourth chapter and he makes that statement again. It's like he's just reiterating over and over. We see where the statement is made about the fellowship of believers in chapter two. Well, then he goes on and says that this love for believers in chapter two is love for other believers. Brings us into fellowship.","start":1648916,"end":1672110},{"text":"But then he goes on later and says this love for the brethren or for other believers shows our relationship with one another and with God. So he's building on these things. So I didn't go any particular order as we just looked at this. I'll just bring out verses one, John 413, if you want to turn there, he says hereby know we that we dwell in Him and he in us because he has given us his Spirit. So there is the first thing.","start":1672490,"end":1706720},{"text":"How do you know that? You know that? You know that you are born again? He has God's spirit within you. He tells us that here.","start":1707230,"end":1717410},{"text":"Romans 814 through Romans 814 16. For as many as are led by the Spirit of God. They are the sons of God. So these are things for you not receive the spirit of bondage again to fear, but you've received the spirit of adoption whereby we cry Abba, Father, the Spirit itself bears witness with our Spirit that we are the children of God. So God's Spirit within you reveals to you the fact of your Salvation.","start":1717460,"end":1753126},{"text":"An unsaved person does not believe, does not receive the Spirit of God. The dwelling Spirit of God is not in an unsaved person. It's only in those who believe. It is our earnest. I like to say our down payment that Paul talks about.","start":1753258,"end":1772754},{"text":"He says in Ephesians 113, in whom also you trusted, after that you heard the word of the truth. Listen, you trusted after you heard the word of truth, the gospel of your Salvation, and whom also after that you believed you were sealed with the Holy Spirit of promise. So you heard the gospel, you believed the gospel, you received the gospel. And when you believed it, God sent His Spirit in to seal you to keep you okay. Does that make sense to you this morning?","start":1772792,"end":1808562},{"text":"His Holy Spirit doesn't leave you. You don't lose your Salvation. He says again in Two Corinthians 122, who hath also sealed us and given us the earnest of the Spirit in our hearts. So the Holy Spirit that comes and dwells within us is like God's down payment. You know what a down payment is?","start":1808696,"end":1830258},{"text":"You go to buy something, you put down money to say, yes, I'm going to buy it. I'm not going to back out of this contract. This is a goodwill statement that I am willing to put forth money to guarantee that I'm going to purchase this. God is the same with His Holy Spirit. Once you accept him as your personal savior, he sends His Holy Spirit to Indwell you.","start":1830284,"end":1855220},{"text":"That is his down payment. Way before you get to the end of life, way before you get before the pearly gates. If there are such things, I guess there is a such thing. But you hear that statement all the time. But we can know before because of his Spirit that dwells in us.","start":1856210,"end":1874120},{"text":"So what does that mean, Brother Kenny? That his Spirit dwells in us. What does the Spirit do? The Spirit reveals the world, the sinner that he needs to be saved. He reveals to the believer of sin of his need to be righteous before God.","start":1875770,"end":1896500},{"text":"He also had their fruits of the Spirit. He said, what do I do? These are results of my Salvation. Again, remember, as I said last week, I was talking about an Orange tree. An Orange tree produces oranges.","start":1897730,"end":1911930},{"text":"Okay, you are born again, God's Spirit within you. You're going to produce something and what you produce and you can write it down. Galatians 522. 23 is love, joy, peace, long suffering, gentleness, goodness, faith, meekness, temperance. These are actions that the Holy Spirit will produce in you.","start":1912550,"end":1940000},{"text":"So God's Spirit inside you reveals to you that you are his child.","start":1940570,"end":1946180},{"text":"I'm going to talk about that a little bit in a minute, but I want to move on.","start":1954470,"end":1958160},{"text":"The fruits of the Spirit are result of your Salvation.","start":1960990,"end":1964450},{"text":"There's many things that we get down further in what we're talking about. The Commandments that we do, his Commandments that we're righteous. A lot of us say that's a requirement for Salvation. Now, that's a result of my Salvation. My Salvation is in Jesus Christ alone through his shed blood on the cross.","start":1966510,"end":1986234},{"text":"It's nothing. Galatians two, eight, nine. For by Grace are you saved through faith? It's not of yourself, not of works, lest any man or woman should both. If you could do something to get to heaven, then you've left Jesus out.","start":1986402,"end":2002240},{"text":"Let me make that Crystal clear this morning. So we're talking about results of Salvation. These are things in the fruit of the Spirit. So what does that look like? What is somebody that doesn't have the spirit and produce the fruit of the Spirit?","start":2002810,"end":2017182},{"text":"Now, you might be thinking of somebody right now just honoring me all the time. No, honey, I'm not talking about you.","start":2017326,"end":2026180},{"text":"She knows I like medicine.","start":2028950,"end":2030730},{"text":"There are people who just go through life bitter, angry, never have anything good to say. Everything's always bad. Everybody's always a bother to them. There's no joy in their heart. There's no peace.","start":2034090,"end":2051530},{"text":"You see this world around us and things are going totally crazy. And have you ever seen anybody just panicking and freaking out about what's going on in this world? He said, yeah, that's me, the Holy Spirit of God. And you revealed to you that even though it all looks bad, your father's in control, that's the Holy Spirit working you. He's working in you to reveal to you peace.","start":2052270,"end":2080034},{"text":"I know it looks bad. I know things are bad, and I'm getting a little bit ahead of myself on joy. It looks very bad. But you still have an inner peace that God is in control. He's working all things for his plan and for his glory.","start":2080202,"end":2096630},{"text":"So for the first point that you would look at, does his Holy Spirit Indwell me? Does his Holy Spirit speak to me? Does his Holy Spirit reveal his word to me? Does his Holy Spirit convict me of sin? Is by his Holy Spirit, am I producing love, joy, peace, long suffering?","start":2096690,"end":2116934},{"text":"Or do I just walk around all the time? We're just mad at the world. That may be a test of your Salvation. Now, I will say this right now that if sin has entered into your life and you are truly a born again believer, sin can taint that sin can cause that, can interfere with that, can hinder that where if you're not walking in the fellowship that God has and you're walking out of fellowship because of sin, you're going to be angry. You're going to be upset.","start":2117042,"end":2149154},{"text":"You're going to be miserable until you come back to the place where you confess your sin and you understand he's faithful and just forgive you sin and cleanse you from all in righteousness. Okay, so sin can hinder it for a time, but it won't last forever. We'll talk about that in a few minutes. So the first one is, does his Holy Spirit Indwell you? Do you see any results of his Holy Spirit within you?","start":2149202,"end":2172634},{"text":"Working the next one? I'd say, if we love the brethren and sisterin, the love the brothers and sisters, what does that mean? Look at one, John 314, one nine. So we know we have passed from death unto life because we love the brethren. He that Loveth not his brother abideth and death whosoever hateth his brother is a murderer.","start":2172672,"end":2199370},{"text":"And you know that no murderer has eternal life abiding in him. Hereby perceive we that the love of God because he laid down his life for us and we ought to lay down our lives for the brethren. So who so half the world's good and see if his brother have need and shutth up his bowels of compassion from him. How dwelleth the love of God in him? My little children, let us not love in word, neither in tongue but in deed and in truth.","start":2199930,"end":2232434},{"text":"And hereby we know that we are of the truth and shall assure our hearts before him. So the next one is, do we love the brethren who are the brethren? First of all, I think it's the household of God. It's the ones in here. Do we love one another?","start":2232602,"end":2252698},{"text":"Do we care for one another? And we say we do. Well, Jesus said that. He said, oh, it's easy to love those who love you. But do you love your enemies?","start":2252784,"end":2263450},{"text":"How do you view other people? Do you love everybody? Could you have looked at Saddam Hussein and said, he needs to be saved, he needs to know the truth. Did you pray for him that he would know the truth? That's an enemy.","start":2264430,"end":2282078},{"text":"That's a tough one, isn't it? But Jesus says that's how you know that the love of God is Jesus died just for me and you right, not the bad people. No, he died for all people. And if he died for all people, he loves all people. And if we love God and we say the love of God is in us, then we love all people.","start":2282114,"end":2306100},{"text":"How do we look at other people? I think is an excellent I've said that before is that you want to know if you're in the fellowship, if you're a true believer and you want to know if you're in the right fellowship with God, you want to know when you're in good, how do you treat other people? You go around mad at them, don't want to be around them. People are stupid. People just do this.","start":2306910,"end":2331370},{"text":"People, they just make me so mad I can't get along with nobody. One, there may be evidence of sin in your life. Two, it may be that the love of God is not in you at all. Hello, I know that's a tough one, but if you can't love everyone, God is love. God sent his son to die for the whole world, right?","start":2331420,"end":2357160},{"text":"So if God loves them, I ought to love them. If I say the love of God is in me. John talks about this in first John. He says, the love of God is in me but doesn't love his brother. So he lives in darkness.","start":2358330,"end":2372170},{"text":"He's not of God. Don't shoot the messenger. This is what John said. This is a Ted. How do you love others?","start":2374170,"end":2382060},{"text":"Maybe a Ted asked of your true conversion experience, your Salvation experience.","start":2382750,"end":2389200},{"text":"And he says, not just by word. I could tell Robin I love you all the time and that would be good. And I do tell her every day, I love you every day. But if I never spent time with her, if I never did anything for her, do I really love her? That's what he's talking about.","start":2391450,"end":2413934},{"text":"Not just in word or indeed, not just by the mouth, but to love him indeed. And in your actions and in the truth of your Word. So do we love the brethren as a test of the assurance of your Salvation? We believe the promises of God. We believe the promises of his Word would be the next one.","start":2413972,"end":2437454},{"text":"Do you believe what God said is true? Is this what God's Word? And is God's Word is true? Do you doubt what he says is a testament because the Holy Spirit will reveal to you this is truth. God said it.","start":2437552,"end":2456018},{"text":"You've heard preachers say God said it, I believe it. So it's true. Well, God said it. Whether I believe it or not, it's still true. Okay, so how we view God's Word?","start":2456044,"end":2471954},{"text":"He says this in one John 511. And this is the record, the gospel, the Bible, God's Word. This is the record that God has given us eternal life. And this life is in his Son. He that hath the Son hath life.","start":2471992,"end":2487338},{"text":"He that hath not the Son hath not life. That's a promise in God's Word. Do you believe on the only begotten of the Father that he came, that he died for your sins on the cross, paid your sin debt, and you put your full trust and faith in him and you will have eternal life. Do you believe that God's Word says it? If you believe that is another test of Salvation.","start":2487484,"end":2513214},{"text":"Someone said, oh, no, you can lose your Salvation. That's sad to me. If you can believe that you can lose your Salvation, then you believe that Jesus wasn't enough. I know these are tough things this morning, but if I could do something to lose my Salvation, then I had to do something to gain my Salvation. And I didn't do anything but believe and trust him.","start":2513262,"end":2539300},{"text":"So for me to lose it meant I had to do something to lose it for me to get it mean I had to get something. I didn't do anything to get it. I can't lose it. He keeps me and that's a whole other study, a whole nother thing. He keeps me by His Grace.","start":2540230,"end":2558046},{"text":"He assures me everlasting life. One, John, one, one, two. For as many as received him to them gave he power to become the sons of God, even to them that believe on his name, even to them that uphold the law, even to them that are baptized, even them that do good things. No, them who believe. Okay.","start":2558238,"end":2585500},{"text":"Is that clear this morning? So do we believe the promises of God then? This fellowship, this love that we have going back to that in one John one, three, six, and seven, the fellowship we have with God and other believers. We talked about the love that we have for others. Now here again, he's reiterating, or maybe he said this first and then I already went to the reiteration.","start":2585830,"end":2614026},{"text":"But the fellowship we have with God and other believers, one, John, one, three, that which we have seen and heard declare unto you. Let me just stop right there. I know I'm talking about our fellowship with God and others, but that was an interesting which we have seen and heard. He says, one John, One, that which was from the beginning, which we have heard and which we seen with our eyes, which we have looked upon and our hands have handled the word of life. He says, for the life was manifest and we have seen it and bear witness and showing you that eternal life which was with the Father and was manifest unto us, that which we have seen and heard declare we unto you that you also may have fellowship with us.","start":2614218,"end":2681190},{"text":"And truly our fellowship is with the Father and with the Son, Jesus Christ. And these things we write into you that your joy may be full. In talking about our fellowship. First, I want to talk about John wanted to make it Crystal clear at the very beginning of first John, in the very beginning of John. Remember what he said in the beginning was the Word.","start":2681240,"end":2705082},{"text":"And the Word was God. The Word was with God. And he says, we beheld his glory. Jordan wanted it very clear. I'm not getting my information from somebody else.","start":2705156,"end":2717000},{"text":"I have a first hand experience of my Savior walking hand in hand with Him in this that I've experienced with Him. What did he say? I want to declare it to you. I think maybe another test of our Salvation. Do you have a desire to share what God has done for you or could you care less?","start":2717990,"end":2746680},{"text":"I got mine. I hope they get theirs. I believe the Holy Spirit within us gives us an ocean, gives us a desire. I want others to know the truth. I want to share what God has done with me.","start":2747790,"end":2761980},{"text":"Have you ever shared what God has done for you? Maybe another boy? It's quiet here this morning.","start":2763210,"end":2770320},{"text":"This is a very, I guess, solemn way to think and to examine ourselves. But I believe. John put these in here as a test for us to be sure to know that we know that we know that we know. Do you want to share your experience with others, that fellowship that I went back, that we also have fellowship, may have fellowship with us, and truly, our fellowship is with the Father. Do you have fellowship with the Father?","start":2772510,"end":2802490},{"text":"Is there a time that you just get alone and just praise him just because? Or is it only happened on Sunday mornings?","start":2803230,"end":2809870},{"text":"I've been driving down the road before and I've heard other Christians tell my boy, I just had a great time, just me and the Lord the other day. Those are evidences of our an unsafe person doesn't do that. You don't drive down the road or sit in the woods and just sing praises to a Holy God that you don't know, that you've never met. You understand all that he's done for it and by his spirit within you just breaks out in praise and worship to him. You have fellowship with him.","start":2812050,"end":2844240},{"text":"And he said, Our fellowship is with the Father and with Jesus Christ. If we say we have fellowship with him and walk in darkness, we lie and do not the truth. So what does he say in there? Oh, I love God, I love Jesus and I'm doing it. But you hang out in places you shouldn't be.","start":2844810,"end":2868240},{"text":"You do things you shouldn't be doing. You talk ways, you shouldn't be talking. He says there's not that fellowship there. Again, sin can hinder that for a time, but it's not going to continue because Hebrews tells us if you're his child, he'll chasing you and he'll correct you, but you're not going to live a lifetime of doing this. He says, we walk in the light as he is in light.","start":2869830,"end":2894170},{"text":"We have fellowship one with another and the blood of Jesus Christ, his Son, cleanses us from all sin. We understand that our sins are covered by him. He cleanses our sin. And when we understand that we want to worship him, we want to have fellowship with Him. And if I want to have fellowship with Him, I want to have fellowship with you.","start":2894220,"end":2915580},{"text":"I've told you all before, I can't wait until Sunday to get here. I can't wait because I want to be with people that believe like I believe that think like I think they want to study God's Word with me. I think if a person just and I'm trying to be real careful, I don't want to be judgmental and I don't want to be condemning. But John lays these out here as examples to examine ourselves. And first of all, I think these are written down for me to examine myself.","start":2917170,"end":2949060},{"text":"But I got to give a warning. If the only time you care anything about Church is Easter and Sunday, you might want to examine yourself.","start":2950650,"end":2959800},{"text":"That's as lovingly as I can put it, I'm not going to say you're not saved. I'm not going to say you are saved, but the fruit doesn't seem to be there. If you care nothing about being in the house of God, with having fellowship. If you have fellowship with God, you'll want to have fellowship with others.","start":2962330,"end":2982340},{"text":"Amen.","start":2984870,"end":2985810},{"text":"I know this is tough, but I can't stand up here and just say, oh, it's okay. It's all right. Just go live your life. Do what you want to do, and thank you. Jesus said that many will come to me in that day and say, Lord, Lord, and the ultimate verdict is, Depart for me.","start":2988450,"end":3008518},{"text":"I never knew you so because I love you, because I love the one, and I want everybody to come to the truth and the lobby of our Lord and Savior. I got to tell you the truth. If there is no desire for fellowship with believers in Christ, maybe an evidence there of something going on, I'll move on.","start":3008544,"end":3035140},{"text":"How about joy in your life? We talked a little bit about joy while ago. Is there joy in your life? Yeah, right. We just come out of a pandemic.","start":3037330,"end":3044814},{"text":"We're on the verge of World War Three. Oh, yeah. I'm just overwhelmed with joy. Right. Kenny's lost his mind this morning.","start":3044922,"end":3053306},{"text":"There's no way you can have joy nowadays, right? Yeah, you can. You absolutely can.","start":3053488,"end":3060160},{"text":"John 1511 these things have I spoken to you that my joy Jesus says, may remain in you and that your joy might be full, eh? Jesus went to the cross Where's joy in that it says, who, for the joy endured the cross. Wait a minute. Where's this joy? This is not a definition of joy we find in Webster, right?","start":3062530,"end":3085206},{"text":"Not the same joy I'm thinking about. John 1622. And you know, therefore, and you now therefore have sorrow. Okay, here we are. But I will see you again and your heart shall rejoice and your joy no man taketh from you.","start":3085388,"end":3106880},{"text":"So now we're getting a little clearer picture of what joy is talking about. Yes, it's bad. Yes, we have sorrow. Yes, we live in a world of sin. Yes, we're on the brink of World War Three.","start":3107690,"end":3118146},{"text":"Some say, yes, we come out of a pandemic, but my God's in control. Jesus is going to come back for me someday.","start":3118208,"end":3126630},{"text":"This is not the end of it. I can't think of the same. This is not the final what's going on? God said, this is what's happening. His word says it.","start":3131250,"end":3141358},{"text":"I believe it. His promises say it's going to get bad and it's going to get worse. But I know the worse it gets, and the harder it gets, the closer I am to heaven. Amen. That's the joy he's talking about, that he is in control no matter what.","start":3141444,"end":3161580},{"text":"John 1633 one of my most favorite verses in the world. When God gave this and showed this to me and revealed the truth to me, I shouted Glory, Robin thought I'd lost my mind these things. Have I spoken unto you that in me you might have peace in the world. You'll have tribulation. But be of good cheer, I've overcome the world.","start":3163290,"end":3188002},{"text":"He is the Victor. He is the King of Kings. He is the Lord of Lords. We can have joy in that. He is my savior when the whole world seems to be just going to hell.","start":3188196,"end":3202054},{"text":"He's my Savior. He's in control. That's the joy he's talking about. Do you have joy? Are you just downhearted and defeated and wore out and you just Moly grub got your lips stuck out all the time and you hate everything and everybody and all this and the government stinks and that government stinks and they do stink, but that's okay.","start":3202212,"end":3223642},{"text":"God's in control of that too. Can you have joy in the midst of the storm? Maybe an evidence of your Salvation because you're standing on the promises of God. You know he's in control. You know this is playing out just as he said.","start":3223716,"end":3243840},{"text":"John 1713. Jesus prayed for us that we would have joy to the Father. He says, and now come, I Jesus saying to Thee the Father. And these things I speak in the world that they might have my joy fulfilled in themselves. Christians, do you have joy?","start":3244230,"end":3267550},{"text":"Do you have joy? John said, that's an evidence of Salvation. That's assurance of your Salvation.","start":3268650,"end":3276550},{"text":"Let's go on. I'm running out of time. How about the wrong perception of sin? How do you view sin? Is it bad?","start":3278850,"end":3287854},{"text":"You don't care? Yes, that's just what everybody else does. How do you perceive sin? One eight through ten. If we say that we have no sin, we deceive ourselves.","start":3288012,"end":3300422},{"text":"And the truth is not in us. Verse ten. If we say that we have not sinned, we make him God, a liar and his word is not in us. There are many out there that say, oh, no, I'm not a sinner. Remember the rich rules all.","start":3300566,"end":3315790},{"text":"From my youth I've kept the law. Jesus pointed out real quick where he fell short of the law, you are a sinner, for all have sinned and come short of the glory of God. First of all, you need to understand you are a sinner.","start":3315840,"end":3329890},{"text":"You have fallen short of the glory God, but by his Grace his son died and paid for that sin on the cross. So first we view sin as do we believe we are sinners first. John three, one through ten. And I don't have time to read them all. But he talks about continuing in sin.","start":3332010,"end":3350654},{"text":"This is a tough one. Go home and read that. He talks about the behold what manner of love hath bestowed upon us. The Father bestowed upon us that we should be called the sons of God. Therefore the world knoweth not because it knew him not blood.","start":3350822,"end":3365558},{"text":"Now are thee the sons of God. And it does not yet appear what we shall be, but we shall know that when he shall appear, we shall be like him, for we shall see him as he is. He said, we're living in a sinful world. It doesn't look like we're Christians because we sin. We have these difficulties and we have these struggles.","start":3365594,"end":3385886},{"text":"We said, oh, it's not going to be the end of it. When he appeared, we will be right. Kim Mark going on down to chapter three, verse six. He says, Whosoever abideth and him sinus not, oh, anybody sinneth, all of us. Right.","start":3386018,"end":3405000},{"text":"And many people struggle with that. Whosoever sinneth hath not seen him neither nor knoweth him. So if you just take that one verse and just take it for what it's saying right there, you say, okay, I've seen so I don't know him, never seen him, don't know nothing about him. That's not what that verse is saying. Why, if it is, why would he give us one John one nine?","start":3406230,"end":3430162},{"text":"If we confess our sins, he is faithful and just to forgive us our sins and quizzes from all unrighteousness. He's talking to believers there. But now he says, if we sin, we don't even know him. Now what he's saying is we continue in sin. If you look up these words and get the devil, it's a continuance of sin.","start":3430296,"end":3449486},{"text":"You live in sin all your life and you can look at this on the internet or you can do this and you can do that and you know it's against the will of God. You know it's sin against God and you just don't care. You're just going to continue in your sin no matter what. There's no Holy Spirit that convicts you. That's how the world does.","start":3449678,"end":3471886},{"text":"They don't know any different people. We get frustrated with the world. How could they do such crazy things? There's no Holy Spirit in them to convict them. Otherwise they're doing what their father does.","start":3471948,"end":3484320},{"text":"Jesus says the Father is the devil. But if you're a believer, you want to do what your father does.","start":3484830,"end":3491700},{"text":"And if you sin, the Holy Spirit convicts you of that sin and you go to one John one nine. And we confess that sin and we rest on the promise he's faithful and just to forgive us that sin. But if we continue in sin, if we keep committing sin, he's committed sin is of the devil. Again, the word committh is a continual thing. Doesn't say we're not going to fall short.","start":3494110,"end":3517970},{"text":"It doesn't say we're not going to fall sometimes. But if we live our entire lives in sin, it's our Father's, the devil. Again, don't shoot the messenger. These are tests that John gives us. Do you know that?","start":3518020,"end":3535178},{"text":"You know you have eternal life. Whoever is born of God does not commit sin. Whoever is born of God does not continue in sin, is what that's saying. You cannot continue in sin for his siege remaineth in him and he cannot continue in sin because he's born of God. If you're his child.","start":3535204,"end":3557906},{"text":"As I said in Hebrews twelve, if you're his child, he's going to correct you. He's going to straighten out you. He's going to reveal his sin to you. And then you have the point of confessing your sin. If you're not his child, you don't know any difference.","start":3557968,"end":3573326},{"text":"You're going to continue in that sin in verse ten. In this, the children of God are manifesting. The children of the devil whosoever doth righteousness is not of God. Whosoever doth not righteousness is not of God. Neither is he that Loveth, not his brother.","start":3573448,"end":3592338},{"text":"Here we go back to love again, to continue in the sin is what he's saying here. Do we keep His Commandments? Oh, boy, here's a good one. The Torah keepers. And all these, the Judaisers, that's all Torah keepers.","start":3592434,"end":3612286},{"text":"They got a new fancy name. We're Torrakeepers. They're Judaizers. They're false doctrine. Jesus was okay, but you got to have the law, too.","start":3612358,"end":3622362},{"text":"And they use these scriptures all the time because the word commandment is there one John 23. And hereby we know that we know Him if we keep His Commandments first. John two, four, he that said, I know Him and keepeth not His Commandments as a liar and the truth is not in Him. Wow. We're talking about the Ten Commandments.","start":3622556,"end":3644974},{"text":"No, we're not talking about the Ten Commandments. How do I know? Keep reading one John 322. So this is what they don't do. They give you those two verses and say, you got to keep the law.","start":3645142,"end":3657260},{"text":"But what he defines what the Commandments of God are and whosoever we ask. And whatsoever we ask, we receive of Him if we keep His Commandments and do those things which are pleasing in his sight. Verse 23 of one, John three. And this is his commandment. He spells it out here that we should believe on the name of the Son of Jesus Christ and love one another as he gave us commandment.","start":3658250,"end":3687630},{"text":"That's the commandment he's talking about there. That we believe God's only commandment to us now is to believe His Son. To believe that he says what he says about Himself is he is the Son of God. He has come to take away the sins of the world. That's God's commandment to you.","start":3688610,"end":3707430},{"text":"Now John spells it out Crystal clear. But they won't give you those verses. They won't go to that. They don't want to talk about that. That we love one another, that we believe in Jesus Christ.","start":3707480,"end":3719934},{"text":"That's the commandment he's talking about here. One John five, two and three. By this we know that we love the children of God when we love God and keep His Commandments. We love the Lord our God with our heart, soul and mind. We love our neighbors and ourselves.","start":3720092,"end":3738630},{"text":"And we've accepted His Son. We believe His Son died for our sins on the cross. We accepted Him. That is another evidence of Salvation. For this is the love of God that we keep his Commandments and his Commandments are not grievous.","start":3739670,"end":3754666},{"text":"Was the law grievous? Very much so. If you don't think so, look back to the law. How much? David struggled with it and Moses struggled with it and they all struggled with it.","start":3754858,"end":3766854},{"text":"They couldn't keep it and they lived a frustrated life. Peter says in Acts 15 that when they were trying to the Gentiles were being saved and they had a big conference of should we impose the law and Christ and Grace or not? And they said no. Peter Stamp says, why would we impose something that we couldn't keep? Neither could our fathers.","start":3766892,"end":3789406},{"text":"It was grievous to us. It was a struggle for us. He says his Commandments aren't grievous. So what's he talking about? To love God and love your neighbor as yourself and believe on his son.","start":3789598,"end":3804080},{"text":"That's not very grievous. Jesus said, in loving God and loving your neighbor, the whole law comes in line with it so that I'm not grievous.","start":3804650,"end":3816030},{"text":"So these are some of the tests here I actually considered. I know I say I'm not a serious preacher, but I almost want to do this series on one or one John, because there's so much in it. I can't cover it in 30, 40 minutes, but I believe these are evidences of Salvation. Does his witness of his spirit within you? Is there a love for others?","start":3818730,"end":3848740},{"text":"Is there a longing to have fellowship with Christians? Do you want to come to God's house? Do you want to study his Word? Do you want to know Him more? Is there a desire or do you just indifferent, a desire to share God's Grace, that God's Grace that he's given to you?","start":3849550,"end":3871940},{"text":"Do you want to share that? Is there joy? Is there peace that passes all understanding? And do you have the right perception of sin? These are just a few and there could be others.","start":3872510,"end":3889302},{"text":"And like I said, I'm praying. Pray with me. Maybe, Lord, let me just do that first, John. Just go verse by verse and break it down for you that you understand it, because I think it's very important. I don't want to be the one that stands before God, before my Savior one day.","start":3889376,"end":3907758},{"text":"And he says, Depart from me. I never knew you. And you know what's worse, I don't want to see my kids stand before him and he tell him the same thing. And I don't want to see any of you stand before him. Let me tell you that we can know that.","start":3907784,"end":3925698},{"text":"We can know that. We can know now the fruits of your Salvation, the results of your Salvation, not the requirements. Are you doing those things that John talks about? He says, if you are understand, sin can hindrance. There's things that come.","start":3925724,"end":3950238},{"text":"We understand that. But is your lifestyle over the span of your life? Do you have a longing for any one of these? Is this your heart's desire or you just don't care.","start":3950264,"end":3963380},{"text":"You can tell a lot about what you believe. You can tell a lot. I hope you understand this this morning. I know this has been a tough one. I know it's been thought provoking.","start":3967170,"end":3978550},{"text":"If you don't know, you can know. John says these things. Have I written in you that you may know that you have eternal life through Jesus Christ, our Lord. Father, these words have pricked my heart and pricked our heart. Lord, as we examine ourselves and see where we stand.","start":3978870,"end":4002166},{"text":"Are we in the right fellowship with you? Or is sin hindering us? Lord? Is our heart and mind right with you? If it's right with you, then it's going to reflect to others around us.","start":4002228,"end":4019810},{"text":"If we love you, we're going to love others. If we want to have that fellowship with you, we want to have fellowship with others. If we want to have fellowship with you, we long to study Your word. We love to hear about you, to learn about you. Lord, we look at sin differently because of the way you look at sin.","start":4019980,"end":4043210},{"text":"You reveal yourself in and through us by your Holy Spirit. And we thank you for that. I pray right now that each and every person that's hearing my voice, that you would give them that assurance without any shadow of a doubt, that I am a believer, that I have trusted Jesus as my personal Savior and Him alone for Salvation. Lord, given the peace that passes on, given that joy that only you can give when Satan would tempt us and distract us and try to confuse us. And Lord, give them peace.","start":4045610,"end":4081650},{"text":"Give them joy. Give them assurance of Salvation. We thank you for Your word, even, Lord, when it's difficult. We thank you that you want us to know more than we want to know ourselves, that we would be found worthy, that we would stand before you covered by the blood of Jesus and Him alone. Thank you for this today.","start":4082150,"end":4108880},{"text":"Speak to our hearts and our mind. Make it Crystal clear, which you have to say to us today. In Jesus name, I pray, Amen. Four as we stand with Him. I could do nothing without Him.","start":4109990,"end":4149314},{"text":"I sure. Leave it without out in my would be drifting like a ship with a Jesus.","start":4149472,"end":4178450},{"text":"Do you know Him? Today did not turn him away.","start":4184390,"end":4193120},{"text":"That's an excellent song. We ought to sing all the verses. Without Him, I could do nothing without Him. I'd be lost. My prayer is that you know Him and that you know that you know that you know that you have eternal life.","start":4213530,"end":4230240},{"text":"Take this and share it with your friends and family. Share with others what God has done for you. I want to thank you for being here today and being with us. I know it's been a tough one. Ain't been very exciting and make you laugh.","start":4233010,"end":4249434},{"text":"And all this is serious. It hurt.","start":4249482,"end":4254470},{"text":"Hurt my heart to think that I wouldn't share with you. I share you all the good stuff and all the great stuff we want to hear. But if I don't let you know there's a chance that you're just playing games there's a chance that you're only Christian by word only and not by deed then I wouldn't be much of a preacher.","start":4257530,"end":4283730},{"text":"I want you to know I love you any doubt if there's anything I can do to help you to understand that to know that please talk to me. This is very serious. So I've been in Church all my life. There's a lot of people in Church have been in Church. All life are going to die and go to hell.","start":4286550,"end":4303440},{"text":"That's just the cold hard facts. If they don't have Jesus depart from me you workers of iniquity the problem is they were working their way to heaven it wasn't by Jesus and him alone. They weren't born again. They weren't a new creation. I'm not going to repeat it.","start":4304190,"end":4324078},{"text":"It's just to pray about it know that you know is my whole point today. Thank you for being here this morning. Anything hearts mind clear you're not going to sneak up behind me. Okay thank you again for that. That was awesome.","start":4324104,"end":4341220},{"text":"I love you all and thank you for that. You got me I got a zero candy bar Ms. Tony gave me. That was awesome. Just love that you showed.","start":4341670,"end":4352238},{"text":"Thank you so much. I don't deserve that but I very much appreciate it. Had a good week. I hope you have a good week this week. If you need me, call me.","start":4352274,"end":4361786},{"text":"Okay God bless you all chat can you go to some prayer but each of us will go our way and speak with any of that are sick and suffering.","start":4361908,"end":4389430}]